#+TITLE: Clinton's Popular Vote Victory in Context
#+PROPERTY: header-args:R  :session *R*
#+OPTIONS: toc:nil
#+INFOJS_OPT: view:f toc:f ltoc:f mouse:underline buttons:0 path:http://thomasf.github.io/solarized-css/org-info.min.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />


People [[http://www.usatoday.com/story/news/politics/onpolitics/2016/08/31/poll-clinton-trump-most-unfavorable-candidates-ever/89644296/][really, really didn't like either of the candidates this
election]]. But, based on election results, it seems likely that [[http://www.independent.co.uk/news/world/americas/us-elections/us-election-hillary-clinton-more-votes-popular-vote-any-candidate-barack-obama-donald-trump-a7413596.html][more
people preferred Hillary Clinton to Donald Trump]]. One NY Times
analyst, Nate Cohn, is forecasting the final popular vote as [[https://twitter.com/Nate_Cohn/status/796409592708268038][Clinton
receiving 63.4 million votes to Donald Trump's 61.2 million]].

I for one am not putting a lot of faith in NY Times analyst forecasts
right at the moment. So let's just look at the votes cast so
far. David Wasserman at Cook Political Report has [[https://docs.google.com/spreadsheets/d/133Eb4qQmOxNvtesw2hdVns073R68EZx4SfCnP4IGQf8/htmlview][compiled official
vote tallies in a spreadsheet]]. As of this writing, those tallies put
Clinton ahead by over 2 million votes. I wanted to put these figures
in context because I, [[http://www.latimes.com/opinion/readersreact/la-ol-le-electoral-college-trump-20161112-story.html][like Donald Trump, am inclined to agree that the
Electoral College is a "disaster for democracy]]."

Because I am a nerd, this whole piece is coded up transparently in [[https://www.r-project.org/][R]]/ 
[[http://orgmode.org/][Emacs org-mode]] and can be re-run once all the votes are tallied and we
have a final margin of popular victory / loss for the two
candidates.

* Assumed popular vote tallies / margin of victory
Let's start with what we pretend we know: popular vote tallies. 

#+NAME: margin-of-victory
#+BEGIN_SRC R :results var :exports code
  library(tidyverse)                      # We'll need these later
  library(ggthemes)
  library(scales)

  vote_tallies_url <- "https://docs.google.com/spreadsheets/d/133Eb4qQmOxNvtesw2hdVns073R68EZx4SfCnP4IGQf8/export?format=csv&id=133Eb4qQmOxNvtesw2hdVns073R68EZx4SfCnP4IGQf8&gid=19"

  vote_tallies_df <- read_csv(url(vote_tallies_url), skip=4) %>%
      filter(State == "U.S. Total")

  voted_hillary <- vote_tallies_df$`Clinton (D)`
  voted_donald  <- vote_tallies_df$`Trump (R)`

  ## Even Fox News is projecting a popular vote victory for Clinton, so
  ## I think it's safe to assume these won't flip.
  (hillary_victory_margin <- voted_hillary - voted_donald)
#+END_SRC

#+RESULTS: margin-of-victory
: 2126077


So there we have it, a margin of victory of call_margin-of-victory() for Clinton.


